First part is an introduction to conditional statements.

In [24]:
'''

First the if block is executed. If condition is fulfilled the code inside the block is executed. If not then 
the else block is executed.

'''

superhero = 'Batman'

if superhero == 'Batman':
    print('DC')
else:
    print('OTHERS')

DC

In [25]:
'''

For handling multiple conditions we use the elif block

'''

name = input('Enter the superhero name')

if name == 'Batman':
    print('DC')

elif name == 'Wolverine':
    print('Marvel')

elif name in ['Naruto','Saitama','Goku']: # We can wrap multiple values in a list and check for it
    print('Anime')

else:
    print('OTHERS')

Enter the superhero nameSaitama
Anime

Introduction to DataFrames

In [26]:
import pandas as pd

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [27]:
names = ['Batman','Wolverine','Naruto','Jedi']
universe = ['DC','Marvel','Anime','StarWars']
powers = [3,3,4,5]

df['Name'] = names
df['Universe'] = universe
df['Powers'] = powers

df.head() # Head function is used to see first few entries in a dataframe. Is used for having a quick glance

        Name  Universe  Powers
0     Batman        DC       3
1  Wolverine    Marvel       3
2     Naruto     Anime       4
3       Jedi  StarWars       5

In [28]:
# Names,Universe,Power are the column names. To pick just one column,we index it

df['Name']

0       Batman
1    Wolverine
2       Naruto
3         Jedi
Name: Name, dtype: object

In [29]:
# To pick multiple columns,we wrap them in a list and index it

df[['Name','Powers']]

        Name  Powers
0     Batman       3
1  Wolverine       3
2     Naruto       4
3       Jedi       5

In [30]:
# To sort the dataframe based on any column , we can use the sort function

df.sort_values(by='Powers',ascending=False,inplace=True) # Inplace means,it will be changed there only and no need for reassign
df

        Name  Universe  Powers
3       Jedi  StarWars       5
2     Naruto     Anime       4
0     Batman        DC       3
1  Wolverine    Marvel       3

In [31]:
# To find the rank based on any column,we use the rank method

df['Rank_Level'] = df['Powers'].rank()
df

        Name  Universe  Powers  Rank_Level
3       Jedi  StarWars       5         4.0
2     Naruto     Anime       4         3.0
0     Batman        DC       3         1.5
1  Wolverine    Marvel       3         1.5

In [32]:
# Here by default the criteria for ranking same values is average

# So if you arrange this records in ascending order. Batman and Wolvering will be in position 1 and 2
# Average of 1 and 2 is 1.5

In [33]:
# Last is we can drop columns from a dataframe using drop method

df.drop('Rank_Level',axis=1,inplace=True)
df

        Name  Universe  Powers
3       Jedi  StarWars       5
2     Naruto     Anime       4
0     Batman        DC       3
1  Wolverine    Marvel       3

In [37]:
# You can use the loc method to slice the dataframe
# let's say we want to see the records for only batman and wolvering

df.loc[df['Name'].isin(['Batman','Wolverine']),['Name','Powers']] # The first case is the condition and the second case is the columns.

        Name  Powers
0     Batman       3
1  Wolverine       3

In [46]:
# You can do the same thing using iloc but iloc is index based so we cant use names there directly.

df.iloc[:,[0,2]].query("Name in ['Batman','Wolverine']")

        Name  Powers
0     Batman       3
1  Wolverine       3